app/views/users/event_detail.html.erb

SELECT "users".* FROM "users" INNER JOIN "owners" ON "users"."id" = "owners"."user_id" WHERE "owners"."event_id" = ?  [["event_id", 1]]
---
        <h1><%= @event.name %></h1>
        <p>Host: <%= @event.user.first_name %></p>