app/views/users/events_dashboard.erb

                        <td><%= event.city %></td>
                        <td><%= event.user.first_name %></td>
---
SELECT  "users".* FROM "users" INNER JOIN "owners" ON "users"."id" = "owners"."user_id" WHERE "owners"."event_id" = ? AND "users"."user_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["event_id", 7], ["user_id", 17], ["LIMIT", 1]]

<!-- IF you aren't hosting or attending the event -->
                                <% unless Owner.where(event_id: event.id, user_id: session[:user_id]).exists? %>
---
SELECT  "owners".* FROM "owners" WHERE "owners"."event_id" = ? ORDER BY "owners"."id" ASC LIMIT ?  [["event_id", 7], ["LIMIT", 1]]
SELECT  1 AS one FROM "owners" WHERE ("owners"."event_id" != ?) AND ("owners"."user_id" != ?) LIMIT ?  [["event_id", 13], ["user_id", 18], ["LIMIT", 1]]