app/controllers/users_controller.rb

    def login
        user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jordan@gmail.com"], ["LIMIT", 1]]

    def register
        @newUser = User.create(new_user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

    def profile_edit
        @user = User.find(session[:user_id])
        @user.update(update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "email" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Jordan1"], ["last_name", ""], ["email", ""], ["city", ""], ["state", ""], ["updated_at", 2017-04-18 18:34:26 UTC], ["id", 14]]

    def add_event
        event = Event.create(name: params[:name], date: params[:date], city: params[:city], state: params[:state], user_id: session[:user_id])
---
INSERT INTO "events" ("name", "date", "city", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "beachh"], ["date", "2017-04-13"], ["city", "yesterday"], ["state", "WA"], ["user_id", 9], ["created_at", 2017-04-18 16:02:45 UTC], ["updated_at", 2017-04-18 16:02:45 UTC]]

    def events_dashboard
        @current_user = User.find(session[:user_id])
        @events_in_users_state = Event.where(state: @current_user.state)
        @events_not_in_users_state = Event.where.not(state: @current_user.state)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE ("events"."state" != ?)  [["state", ""]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def event_detail
        @event = Event.find(params[:id])
        @attendees = Event.find(params[:id]).users
        @comments = Comment.where(event_id: @event.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "owners" ON "users"."id" = "owners"."user_id" WHERE "owners"."event_id" = ?  [["event_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]

    def edit_event
        @current_event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def destroy_event
        Event.find(params[:event_id]).destroy
        Owner.where(event_id: params[:event_id]).destroy_all
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 9]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "owners".* FROM "owners" WHERE "owners"."event_id" = ?  [["event_id", 13]]

    def update_event
        current_event = Event.find(params[:event_id])
        current_event.update(name: params[:name], date: params[:date], city: params[:city], state: params[:state])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "state" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "vegas trip111"], ["state", "AL"], ["updated_at", 2017-04-19 05:10:28 UTC], ["id", 11]]

    def add_comment
        comment = Comment.create(content: params[:comment], user_id: session[:user_id], event_id: params[:event_id])
---
INSERT INTO "comments" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "asASdasdf"], ["user_id", 13], ["event_id", 1], ["created_at", 2017-04-18 18:31:38 UTC], ["updated_at", 2017-04-18 18:31:38 UTC]]

    def join_event
        owner = Owner.create(user_id: session[:user_id], event_id: params[:event_id])
---
INSERT INTO "owners" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 18], ["event_id", 10], ["created_at", 2017-04-19 05:20:49 UTC], ["updated_at", 2017-04-19 05:20:49 UTC]]

    def cancel
        owner = Owner.where(user_id: session[:user_id], event_id: params[:event_id]).first
        owner.destroy
---
SELECT  "owners".* FROM "owners" WHERE "owners"."user_id" = ? AND "owners"."event_id" = ? ORDER BY "owners"."id" ASC LIMIT ?  [["user_id", 16], ["event_id", 7], ["LIMIT", 1]]
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 12]]